Repository: Ezz-N-Moqayad/SmartServiceFlutter
Catalog: lib/l10n/app_*.arb
Languages: ar, he

source: Login
ar: تسجيل دخول
he: התחברות

source: phone Number
ar: رقم الجوال
he: מספר טלפון

source: Activation Code
ar: كود التفعيل
he: קוד הפעלה

# sendSms
source: The activation code has been sent to the number
ar: لقد تم إرسال كود التفعيل إلى الرقم
he: קוד ההפעלה נשלח למספר

# numberOfCode
source: Consists of 6 numbers
ar: مكون من 6 أرقام
he: זה מורכב מ-6 מספרים

source: Confirm Number
ar: تأكيد الرقم
he: אשר את המספר

# enterCode
source: Code
ar: الرمز
he: להזין את הקוד

# enterNumber
source: Enter Your Number
ar: أدخل رقم الهاتف
he: הזן מספר טלפון

# dontReceive
source: I did not receive the activation code?
ar: لم أستلم كود التفعيل؟
he: לא קיבלתי את קוד ההפעלה?

# sendAgain
source: re-send
ar: أعد الارسال
he: לשלוח מחדש

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب ؟
he: אין לך חשבון?

# registration
source: sign up
ar: تسجيل
he: הירשם

# registerNewUser
source: Register a new user
ar: تسجيل مستخدم جديد
he: רשום משתמש חדש

# descriptionForResister
source: You can choose to register your details as a customer or service provider
ar: يمكنك اختيار تسجيل بياناتك كعميل أو مزود خدمة
he: אתה יכול לבחור לרשום את פרטיך כלקוח או כספק שירות

source: Client
ar: عميل
he: לָקוּחַ

source: Service Provider
ar: مزود خدمة
he: ספק שירות

# registerClient
source: Customer Registration
ar: تسجيل عميل
he: רישום לקוח

# enterData
source: Please enter your data
ar: يرجى ادخال بياناتك
he: נא להזין את הנתונים שלך

# descriptionForResisterClient
source: You can type your username in the field provided below
ar: يمكنك كتابة اسم المستخدم في الخانة المخصصة له أدناه
he: אתה יכול להקליד את שם המשתמש שלך בשדה המצורף למטה

source: Next
ar: التالي
he: הבא

source: Name
ar: الاسم
he: השם

source: Enter Your Name
ar: أكتب اسمك
he: כתוב את שמך

# registerServiceProvider
source: Service Provider Registration
ar: تسجيل مزود خدمة
he: רישום ספק שירות

source: Location
ar: الموقع
he: האתר

source: Enter Your Location
ar: أدخل موقعك
he: הכנס את מיקומך

source: Service Selection
ar: اختيار الخدمة
he: בחירת שירות

source: Service
ar: الخدمة
he: השירות

source: Sub Service
ar: الخدمة الفرعية
he: שירות משנה

# priceOfService
source: Price Service
ar: سعر الخدمة
he: מחיר שירות

# enterpriceOfService
source: Enter the service price
ar: أدخل سعر الخدمة
he: הזן את מחיר השירות

source: Service Details
ar: تفاصيل الخدمة
he: פרטי שירות

source: Enter your service details
ar: أدخل تفاصيل الخدمة الخاصة بك
he: הזן את פרטי השירות שלך

source: Address
ar: العنوان
he: הכתובת

source: Enter address details
ar: أدخل تفاصيل العنوان
he: הזן פרטי כתובת

source: Work Time
ar: وقت العمل
he: זמן עבודה

source: Enter working time
ar: أدخل وقت العمل
he: הזן זמן עבודה

source: Skip
ar: تخطي
he: לדלג

# title_view1
source: Hello!
ar: مرحبا!
he: שלום!

# page_view1
source: Share with us ... more than 100 services in the application
ar: شارك معنا ... اكثر من ١٠٠ خدمة في التطبيق
he: שתפו אותנו ... יותר מ-100 שירותים באפליקציה

# title_view2
source: payment methods
ar: طرق الدفع
he: שיטות תשלום

# page_view2
source: You are free to choose either upon receipt or card payment
ar: لك حرية الاختيار إما عند الاستلام أو الدفع بالبطاقة
he: אתה חופשי לבחור או עם קבלה או תשלום בכרטיס

# title_view3
source: Application workplaces
ar: أماكن عمل التطبيق
he: מקומות עבודה ליישום

# page_view3
source: The application works throughout and in cities of the West Bank and Jerusalem
ar: يعمل التطبيق في جميع أنحاء ومدن الضفة الغربية والقدس
he: האפליקציה פועלת בכל ובערים בגדה המערבית וירושלים

source: Select your location
ar: حدد موقعك
he: בחר את המיקום שלך

source: Hello, Manal Mansour
ar: مرحباً, منال منصور
he: שלום, מנאל מנצור

source: How can we help you?
ar: كيف يمكننا مساعدتك؟
he: איך נוכל לעזור לך?

source: What service are you looking for
ar: ما الخدمة التي تبحث عنها
he: איזה שירות אתה מחפש

source: Home maintenance service
ar: خدمة صيانة المنازل
he: שירות תחזוקת הבית

source: Service details
ar: تفاصيل عن الخدمة
he: פרטי שירות

source: Home
ar: الرئيسية
he: רָאשִׁי

# notices
source: Notification
ar: اشعارات
he: הוֹדָעָה

source: About Us
ar: عنا
he: עלינו

source: Exit
ar: خروج
he: יְצִיאָה

# my_tutors_serviceMy_tutors_service
source: My tutor's service
ar: خدمة معلمي الخاص
he: השירות של המורה שלי

source: Home delivery service
ar: خدمة التوصيل المنزلي
he: שירות משלוחים עד הבית

source: Online shopping service
ar: خدمة التسوق الالكتروني
he: שירות קניות מקוון

source: Health care service
ar: خدمة العناية الصحية
he: שירות בריאות

source: Other services
ar: خدمات أخرى
he: שירותים אחרים

source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
he: האם אתה בטוח שאתה רוצה להתנתק؟

source: Yes
ar: نعم
he: כן

source: NO
ar: لا
he: לא

# demoText
source: Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages
ar: لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريدأكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواسأيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايتنيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.
he: Lorem Ipsum הוא פשוט טקסט דמה של תעשיית הדפוס והקביעה. Lorem Ipsum היה טקסט הדמה הסטנדרטי של התעשייה מאז שנות ה-1500, כאשר מדפסת לא ידועה לקחה גלריה של סוג וערבכה אותה כדי ליצור ספר דגימות. הוא שרד לא רק חמש מאות שנים, אלא גם את הקפיצה לתוך כתיבה אלקטרונית, שנותרה ללא שינוי. זה זכה לפופולריות בשנות ה-60 עם שחרורו של גיליונות Letraset המכילים קטעי Lorem Ipsum, ולאחרונה עם תוכנות לפרסום שולחני כמו Aldus PageMaker, כולל גרסאות של Lorem Ipsum.

# whoUs
source: Who Are We
ar: من نحن
he: מי אנחנו

source: Our services
ar: خدماتنا
he: השירותים שלנו

source: Contact Us
ar: تواصل معنا
he: צור קשר

source: Request whatever services you want
ar: اطلب ما تريد من خدمات
he: בקש כל שירות שאתה רוצה

source: Enter
ar: دخول
he: כְּנִיסָה

# addAddressOfYourHouse
source: Add home address
ar: أضف عنوان المنزل
he: הוסף כתובת בית

# cityName
source: Ramallah
ar: رام الله
he: רמאללה

# chooseAddressOnMap
source: Choose an address on the map
ar: اختر عنوان على الخريطة
he: בחר כתובת במפה

source: Save Address
ar: حفظ العنوان
he: לשמור כתובת

source: Apartment number
ar: رقم الشقة
he: מספר דירה

# floorNumber
source: Floor No.
ar: رقم الطابق
he: קומה מס'

source: Details Order
ar: تفاصيل الطلب
he: פרטי הזמנה

source: All
ar: الكل
he: את כל

source: Electricity
ar: كهرباء
he: חשמל

source: Pipes
ar: مواسير
he: צינורות

source: Conditioners
ar: مكيفات
he: מזגנים

source: Maintenance
ar: صيانة
he: תחזוקה

source: Paint
ar: دهان
he: צֶבַע

source: House Cleaning
ar: تنظيف منازل
he: ניקיון בית

source: Troubleshooting Drums
ar: اصلاح أعطال الطبلون
he: פתרון בעיות בתופים

source: Shekel
ar: شيكل
he: שֶׁקֶל

source: Your request has been successful!
ar: تم طلبك بنجاح!
he: בקשתך הצליחה!

source: Your order will be kept on hold until the service provider sees it
ar: طلبك سيبقى قيد الانتظار حتى يراه مزود الخدمة
he: ההזמנה שלך תישמר בהמתנה עד שספק השירות יראה אותה

source: OK
ar: موافق
he: בסדר

source: Something went wrong!
ar: حدث خطأ ما!
he: משהו השתבש!

source: We apologize for this inconvenience, you can reconfirm the order again
ar: نتأسف لهذا الخلل يمكنك إعادة تأكيد الطلب مرة أخرى
he: אנו מתנצלים על אי הנוחות, אתה יכול לאשר שוב את ההזמנה

source: You have been disconnected!
ar: تم قطع اتصالك!

source: Please try again
ar: يرجى المحاولة مرة أخرى
he: בבקשה נסה שוב

source: Try again
ar: حاول مجدداً
he: נסה שוב

# serviceProviders
source: Here you will find a list of the service providers you have requested
ar: مزودي الخدمة
he: ספקי שירות

# choiceService
source: You can choose the service provider as per your request
ar: تجد هنا قائمة بمزودي الخدمة التي طلبتها
he: כאן תמצא רשימה של נותני השירות שביקשת

# whatChoice
source: You can choose the service provider as per your request
ar: يمكنك اختيار مزود الخدمة حسب طلبك
he: אתה יכול לבחור את ספק השירות לפי בקשתך

# nameService
source: johina mohammed
ar: جهينة محمد
he: גוהינה מוחמד

# jobService
source: Technician in the establishment and maintenance of apartments
ar: فني في تأسيس و صيانة الشقق
he: טכנאי בהקמה ואחזקת דירות

# seeOrders
source: See the list of orders here
ar: يمكنك الاطلاع على قائمة الطلبات هنا
he: אתה יכול לראות את רשימת ההזמנות כאן

source: Restaurants
ar: مطاعم
he: מסעדות

source: Cafes
ar: كافيهات
he: בתי קפה

source: Supermarket
ar: سوبر ماركت
he: סופרמרקט

source: Delivery Companies
ar: شركات توصيل
he: חברות משלוחים

source: Bubbly
ar: أرجيلة
he: תוֹסֵס

source: Kentucky Restaurant
ar: مطعم كنتاكي
he: מסעדת קנטקי

source: Fast Food Restaurant
ar: مطعم للوجبات السريعة
he: מסעדת מזון מהיר

source: McDonald's Restaurant
ar: مطعم ماكدونلز
he: מסעדת מקדונלדס

source: Now Open
ar: مفتوح الآن
he: עכשיו פתוח

source: Closed Now
ar: مغلق الآن
he: סגור עכשיו

# here_you_will_find
source: Here you will find a list of the meals available in the restaurant
ar: تجد هنا قائمة بالوجبات المتوفرة داخل المطعم
he: כאן תמצאו רשימה של הארוחות הזמינות במסעדה

# you_can_choose_what
source: You can choose what you want to eat today
ar: يمكنك اختيار ما تريد تناوله اليوم
he: אתה יכול לבחור מה אתה רוצה לאכול היום

source: Super Mega Deal - Mix
ar: سوبر ميجا ديل - مكس
he: סופר מגה דיל - מיקס

# pieces_of_chicken_fries
source: 12 pieces of chicken + fries
ar: 12 قطعة دجاج + بطاطا
he: 12 חתיכות עוף + צ'יפס

# this_order
source: current orders
ar: الطلبات الحالية
he: הזמנות נוכחיות

# before_order
source: Previous orders
ar: الطلبات السابقة
he: הזמנות קודמות

source: Send
ar: ارسال
he: לִשְׁלוֹחַ

source: The Description
ar: الوصف
he: התיאור

source: Contains
ar: تحتوي
he: מכיל

source: Customize Order
ar: تخصيص الطلب
he: התאמה אישית של סדר

source: Normal/hot
ar: عادي/حار
he: רגיל/חם

source: Choose a side dish
ar: اختار طبق جانبي
he: בחר תוספת

source: Add a drink
ar: إضافة مشروب
he: להוסיף משקה

source: Other additions
ar: اضافات أخرى
he: תוספות אחרות

source: number of meals
ar: عدد الوجبات
he: מספר ארוחות

source: Back
ar: رجوع
he: חזור

source: Cabbage Salad
ar: سلطة ملفوف
he: סלט כרוב

source: Mayonnaise Salad
ar: سلطة مايونيز
he: סלט מיונז

source: Coca Cola
ar: كوكا كولا
he: קוקה קולה

source: seven Up
ar: سفن أب
he: סבן אפ

source: Use the delivery service
ar: استخدام خدمة التوصيل
he: השתמש בשירות המשלוחים

source: Bring the meal in person
ar: أحضر الوجبة بشكل شخصي
he: הביאו את הארוחה באופן אישי

source: Select the region
ar: حدد المنطقة
he: בחר את האזור

source: Ram allah
ar: رام الله
he: רמאללה

source: Delivery Price
ar: سعر التوصيل
he: מחיר משלוח

# the_total_amount
source: Total Amount :
ar: إجمالي المبلغ :
he: הסכום הכולל :

source: Add service details
ar: إضافة تفاصيل الخدمة
he: הוסף פרטי שירות

# select_the_appropriate_day
source: Select the appropriate day to receive the service
ar: حدد اليوم المناسب لتلقي الخدمة
he: בחר את היום המתאים לקבלת השירות

source: Service Day
ar: يوم الخدمة
he: יום שירות

source: Enter Today
ar: أدخل اليوم
he: היכנס היום

# select_the_appropriate_time
source: Select the appropriate time to receive the service
ar: حدد الوقت المناسب لتلقي الخدمة
he: בחר את הזמן המתאים לקבלת השירות

source: Service Time
ar: وقت الخدمة
he: זמן שירות

source: Enter Time
ar: أدخل وقت
he: הזן זמן

source: Review Order Details
ar: مراجعة تفاصيل الطلب
he: בדוק את פרטי ההזמנה

source: Request Date
ar: موعد الطلب
he: תאריך מבוקש

source: The Service
ar: الخدمة
he: השירות

# ram_allah_al_quds
source: Ramallah - Al-Quds Street - Building 23
ar: رام الله-شارع القدس-عمارة 23
he: רחוב רמאללה-אלקודס-בניין 23

source: Notes :
ar: ملاحظات :
he: הערות :

# i_have_a_problem
source: I ave a problem with the electricity
ar: لدي مشكلة في الكهرباء
he: יש לי בעיה עם החשמל

source: Payment Details
ar: تفاصيل الدفع
he: פרטי תשלום

source: Transportation Allowance
ar: بدل تنقلات
he: דמי הובלה

source: Inspection Fee:
ar: رسوم فحص:
he: דמי בדיקה:

source: Wallet Deduction:
ar: خصم من المحفظة:
he: ניכוי ארנק:

source: Payment Method :
ar: طريقة الدفع :
he: אמצעי תשלום :

source: Cash Money
ar: نقداً
he: כסף מזומן

source: Total Payment
ar: إجمالي الدفع
he: תשלום כולל

source: Order Notices
ar: اشعارات الطلب
he: הודעות הזמנה

source: Order Number:
ar: طلبية رقم:
he: מספר הזמנה:

source: Ordered On
ar: تم الطلب بتاريخ
he: הוזמן ב

source: Acceptance
ar: قبول
he: קַבָּלָה

source: Reject
ar: رفض
he: לדחות

source: Customer Name:
ar: اسم العميل:
he: שם הסוכן:

source: Order Status
ar: حالة الطلب
he: מצב הזמנה

source: View Details
ar: عرض التفاصيل
he: הצג פרטים

source: Electrical Maintenance Worker Request
ar: طلب عامل صيانة كهرباء
he: בקשת עובד תחזוקת חשמל

source: Order Arrived
ar: وصل الطلب
he: ההזמנה הגיעה

source: I am waiting
ar: في الانتظار
he: אני מחכה
